### 1. Create a datatable object

In [1]:
import pandas as pd

data = {
    'Name' : ['Bhavya', 'Lowkya'],
    'Age' : [22, 23],
    'Gender' : ['F','F']
}

df = pd.DataFrame(data)
print(df)

     Name  Age Gender
0  Bhavya   22      F
1  Lowkya   23      F

### 2. Create  a datatable object with a name by using constructor

In [2]:
class DataTable:
    def __init__(self, name, data):
        self.name = name
        self.data = data

    def display(self):
        print(f"DataTable Name: {self.name}")
        for row in self.data:
            print(row)

data = [
    ['Name', 'Age', 'City'],
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]
datatable = DataTable('MyDataTable', data)

datatable.display()

DataTable Name: MyDataTable
['Name', 'Age', 'City']
['Alice', 25, 'New York']
['Bob', 30, 'Los Angeles']
['Charlie', 35, 'Chicago']

### 3. Write any 10 properties of DataTable

In [3]:
import pandas as pd

data_table = pd.DataFrame({
    'Column1': [1, 2, 3],
    'Column2': ['A', 'B', 'C']
})

# Properties 
columns = data_table.columns  # collection of columns that belong to the DataFrame.
rows = data_table.iterrows()  # Iterates over rows in the DataFrame.
table_name = "ExampleTable"  # No direct equivalent, assigning a custom name to the DataFrame.
primary_key = data_table.set_index('Column1')  # Setting a column as primary key
constraints = []  # No direct equivalent for constraints in pandas.
namespace = "ExampleNamespace"  # Custom namespace, no direct equivalent in pandas.
extended_properties = {}  # Custom properties dictionary, similar to user-defined metadata.
default_view = data_table  # In pandas, the DataFrame itself acts as the view.
parent_relations = []  # Relationships are not directly represented in pandas DataFrame.
child_relations = []  # Relationships are not directly represented in pandas DataFrame.

### 4. Write any 10 method of DataTable

In [ ]:
import pandas as pd

data_table = pd.DataFrame({
    'Column1': [1, 2, 3],
    'Column2': ['A', 'B', 'C']
})

# Methods of DataTable equivalent
data_table_copy = data_table.copy()  # Copies both the structure and data for the DataFrame.
new_row = pd.DataFrame([{'Column1': 4, 'Column2': 'D'}])  # Creating a new row for the DataFrame.
selected_rows = data_table[data_table['Column1'] > 1]  # Selects rows that match a filter condition.
merged_data_table = pd.concat([data_table, new_row])  # Merges the specified DataFrame with the current DataFrame.
data_table_reverted = data_table_copy  # Revert changes by assigning the copied DataFrame.
data_table = pd.read_csv('example.csv')  # Loads values from a data source using a CSV file.
data_table.clear()  # Clears all data from the DataFrame.

### 5.  Add 4 columns(EmpId, EmpName, Emp Salary,  Department) to this data table object using columns.add() method.

In [5]:
import pandas as pd

columns = ['EmpId', 'EmpName', 'EmpSalary', 'Department']
data = []

df = pd.DataFrame(data, columns=columns)

for column in df.columns:
    print(f"Column Name: {column}")

Column Name: EmpId
Column Name: EmpName
Column Name: EmpSalary
Column Name: Department

### 6. Add 5 records to this datatable object using Rows.Add() method.

In [10]:
import pandas as pd

col = ['EmpId', 'EmpName', 'EmpSalary', 'Department']
data = []

df = pd.DataFrame(data, columns = col)

df = df.append({'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'}, ignore_index=True)
df = df.append({'EmpId': 2, 'EmpName': 'lowkya', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)
df = df.append({'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'}, ignore_index=True)
df = df.append({'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'}, ignore_index=True)
df = df.append({'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)

df

C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\381092085.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\381092085.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 2, 'EmpName': 'lowkya', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\381092085.py:10: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\381092085.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\381092085.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)

  EmpId  EmpName EmpSalary Department
0     1   Bhavya     60000         IT
1     2   lowkya     70000         HR
2     3    Mohan     50000      Sales
3     4    Gopal     60000    Finance
4     5  Praveen     70000         HR

### 7. Print the EmpId column of this datatable using for loop

In [13]:
import pandas as pd

col = ['EmpId', 'EmpName', 'EmpSalary', 'Department']
data = []

df = pd.DataFrame(data, columns = col)

df = df.append({'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'}, ignore_index=True)
df = df.append({'EmpId': 2, 'EmpName': 'lowkya', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)
df = df.append({'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'}, ignore_index=True)
df = df.append({'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'}, ignore_index=True)
df = df.append({'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)

for i in df['EmpId']:
    print(i)

1
2
3
4
5

C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\1999630001.py:8: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\1999630001.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 2, 'EmpName': 'lowkya', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\1999630001.py:10: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\1999630001.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'}, ignore_index=True)
C:\Users\bbhav\AppData\Local\Temp\ipykernel_27544\1999630001.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}, ignore_index=True)

### 8. Print the EmpId column of this datatable using foreach loop

In [14]:
import pandas as pd

df = pd.DataFrame([
    {'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'},
    {'EmpId': 2, 'EmpName': 'Lowkya', 'EmpSalary': 70000, 'Department': 'HR'},
    {'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'},
    {'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'},
    {'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}
])
for emp_id in df['EmpId']:
    print(emp_id)

1
2
3
4
5

### 9. Print the EmpId column of this datatable using DataRow property

In [16]:
import pandas as pd

df = pd.DataFrame([
    {'EmpId': 1, 'EmpName': 'Bhavya', 'EmpSalary': 60000, 'Department': 'IT'},
    {'EmpId': 2, 'EmpName': 'Lowkya', 'EmpSalary': 70000, 'Department': 'HR'},
    {'EmpId': 3, 'EmpName': 'Mohan', 'EmpSalary': 50000, 'Department': 'Sales'},
    {'EmpId': 4, 'EmpName': 'Gopal', 'EmpSalary': 60000, 'Department': 'Finance'},
    {'EmpId': 5, 'EmpName': 'Praveen', 'EmpSalary': 70000, 'Department': 'HR'}
])

for index, row in df.iterrows():
    print(row['EmpId'])

1
2
3
4
5

### 10. Create another datatable with  5 columns(Your choice) and  4 records.

In [26]:
import pandas as pd

df = pd.DataFrame([
    {'Name': 'Bhavya','Age': 22, 'Grade': 'A', 'Gender': 'F', 'Place': 'Hyderabad'},
    {'Name': 'Lowkya','Age': 23, 'Grade': 'A', 'Gender': 'F', 'Place': 'Nizamabad'},
    {'Name': 'Mohan','Age': 24, 'Grade': 'C', 'Gender': 'M', 'Place': 'Hyderabad '},
    {'Name': 'Gopal','Age': 27, 'Grade': 'B', 'Gender': 'M', 'Place': 'Warangal'}

])
df

     Name  Age Grade Gender       Place
0  Bhavya   22     A      F   Hyderabad
1  Lowkya   23     A      F   Nizamabad
2   Mohan   24     C      M  Hyderabad
3   Gopal   27     B      M    Warangal

### 11. Create a DataSet object

In [18]:
import pandas as pd

dataset = pd.DataFrame([
    {'Name': 'Bhavya','Age': 22, 'Grade': 'A', 'Gender': 'F'},
    {'Name': 'Lowkya','Age': 23, 'Grade': 'A', 'Gender': 'F'},
    {'Name': 'Mohan','Age': 24, 'Grade': 'C', 'Gender': 'M'},
    {'Name': 'Gopal','Age': 27, 'Grade': 'B', 'Gender': 'M'}
])
dataset

     Name  Age Grade Gender
0  Bhavya   22     A      F
1  Lowkya   23     A      F
2   Mohan   24     C      M
3   Gopal   27     B      M

### 12. Create a DataSet object with name 'MyDataSet' using its constructor

In [21]:
import pandas as pd

MyDataSet = pd.DataFrame({
    'EmpId': [1,2,3,4],
    'EmpName': ['Bhavya', 'Lowkya', 'Mohan', 'Gopal'],
    'EmpSalary': [60000, 70000, 50000, 60000],
    'Department': ['IT', 'HR', 'Sales', 'Finance']
})

MyDataSet

   EmpId EmpName  EmpSalary Department
0      1  Bhavya      60000         IT
1      2  Lowkya      70000         HR
2      3   Mohan      50000      Sales
3      4   Gopal      60000    Finance

### 13. Add above two datatables to MyDataSet DataSet using Tables.Add() method

In [29]:
import pandas as pd

MyDataSet = pd.DataFrame({
    'EmpId': [1,2,3,4],
    'EmpName': ['Bhavya', 'Lowkya', 'Mohan', 'Gopal'],
    'EmpSalary': [60000, 70000, 50000, 60000],
    'Department': ['IT', 'HR', 'Sales', 'Finance']
})

dataset = pd.DataFrame([
    {'Name': 'Bhavya','Age': 22, 'Grade': 'A', 'Gender': 'F'},
    {'Name': 'Lowkya','Age': 23, 'Grade': 'A', 'Gender': 'F'},
    {'Name': 'Mohan','Age': 24, 'Grade': 'C', 'Gender': 'M'},
    {'Name': 'Gopal','Age': 27, 'Grade': 'B', 'Gender': 'M'}
])

combined_df = pd.concat([MyDataSet,dataset],ignore_index=True,sort = False)
combined_df

   EmpId EmpName  EmpSalary Department    Name   Age Grade Gender
0    1.0  Bhavya    60000.0         IT     NaN   NaN   NaN    NaN
1    2.0  Lowkya    70000.0         HR     NaN   NaN   NaN    NaN
2    3.0   Mohan    50000.0      Sales     NaN   NaN   NaN    NaN
3    4.0   Gopal    60000.0    Finance     NaN   NaN   NaN    NaN
4    NaN     NaN        NaN        NaN  Bhavya  22.0     A      F
5    NaN     NaN        NaN        NaN  Lowkya  23.0     A      F
6    NaN     NaN        NaN        NaN   Mohan  24.0     C      M
7    NaN     NaN        NaN        NaN   Gopal  27.0     B      M

### 14. Write any 3 Properties of ArrayList

In [34]:
# 1. Dynamic Size: List size grows automatically
list = []
list.append(10)
list.append(20)
print("Size after adding elements:", len(list))

Size after adding elements: 2

In [35]:
# 2. Allows Duplicate Elements
list.append(10)  
print("List after adding duplicate:", list)

List after adding duplicate: [10, 20, 10]

In [36]:
# 3. Maintains Insertion Order
fruits = []
fruits.append("Apple")
fruits.append("Banana")
fruits.append("Cherry")
print("Fruits in insertion order:", fruits)

Fruits in insertion order: ['Apple', 'Banana', 'Cherry']

### 15. Write any 3 methods of ArrayList

In [31]:
### 1. append()
array_list = []
array_list.append('Bhavya')
array_list.append(42)
print('Output:', array_list)

Output: ['Bhavya', 42]

In [32]:
### 2. Remove()
array_list = ['Paradise','Bavarchi','Mandi','Mehfil']
print('Before removing:', array_list)
array_list.remove('Bavarchi')
print('After removing Bavarchi:', array_list)

Before removing: ['Paradise', 'Bavarchi', 'Mandi', 'Mehfil']
After removing Bavarchi: ['Paradise', 'Mandi', 'Mehfil']

In [33]:
### 3. sort()
array_list = [5,3,7,1,9]
print("Before sorting:", array_list)  
array_list.sort()
print("After sorting:", array_list)

Before sorting: [5, 3, 7, 1, 9]
After sorting: [1, 3, 5, 7, 9]

### 16. Difference between Array and Arraylist

In [51]:
from array import array

In [52]:
## 1. Size
# Arrays have a fixed size
fixed_array = array('i', [1, 2, 3, 4, 5]) 
fixed_array.append(6)
print(fixed_array)

# ArrayLists in Python can be implemented using lists which are dynamic
dynamic_list = [1, 2, 3, 4, 5] 
dynamic_list.append(6) 
print(dynamic_list)

array('i', [1, 2, 3, 4, 5, 6])
[1, 2, 3, 4, 5, 6]

In [53]:
# 2. Type
# Arrays can only hold elements of the same type (e.g., all integers)
int_array = array('i', [1, 2, 3])

# Lists can hold elements of different types
mixed_list = [1, "two", 3.0]

In [54]:
# 3. Memory Management
# Arrays are more memory-efficient for a fixed number of elements
# Lists may use more memory due to dynamic resizing
import sys
print("Size of fixed_array:", sys.getsizeof(fixed_array))
print("Size of dynamic_list:", sys.getsizeof(dynamic_list))

Size of fixed_array: 116
Size of dynamic_list: 104

In [55]:
# 4. Syntax
# Array declaration
fixed_array = array('i', [1, 2, 3, 4, 5])  # Declaration of an integer array

# List declaration
dynamic_list = [1, 2, 3, 4, 5]  # Declaration of a list

# Conclusion
print("Fixed array:", fixed_array)
print("Dynamic list:", dynamic_list)

Fixed array: array('i', [1, 2, 3, 4, 5])
Dynamic list: [1, 2, 3, 4, 5]

### 17. Create a Arraylist and add 3 string elements  'One' , 'Two' , 'Three' by using add method

In [57]:
l = []
l.append('One')
l.append('Two')
l.append('Three')
l

['One', 'Two', 'Three']

### 18. Print the above arraylist element using for and foreach loop

In [65]:
l = []
l.append('One')
l.append('Two')
l.append('Three')

In [66]:
## for loop
for i in range(len(l)):
    print(l[i])

One
Two
Three

In [67]:
## foreach loop
for i in l:
    print(i)

One
Two
Three

### 19. Remove all the elements in the ArrayList using Clear method

In [68]:
l = ["One", "Two", "Three"]

l.clear()

print(l)

[]

### 20. Reverse all the elements in the ArrayList using  Reverse method

In [69]:
l = ["One", "Two", "Three"]

l.reverse()

print(l)

['Three', 'Two', 'One']

### 21. Sort all the elements in the ArrayList using  Sort method

In [71]:
l = [6,4,7]

l.sort()

print(l)

[4, 6, 7]